2gua.rainbow-brackets
astro-build.astro-vscode
bierner.color-info
bradlc.vscode-tailwindcss
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
esafirm.kotlin-formatter
esbenp.prettier-vscode
firsttris.vscode-jest-runner
formulahendry.code-runner
fwcd.kotlin
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
in4margaret.compareit
jorgeserrano.vscode-csharp-snippets
kisstkondoros.vscode-gutter-preview
mathiasfrohlich.kotlin
miguelsolorio.fluent-icons
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
naco-siren.gradle-language
pkief.material-icon-theme
redhat.java
sirtori.indenticator
usernamehw.errorlens
visualstudioexptteam.vscodeintellicode
vivaxy.vscode-conventional-commits
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-lombok
vscjava.vscode-maven
vscjava.vscode-spring-initializr
vscodevim.vim
wallabyjs.quokka-vscode
yzhang.markdown-all-in-one
zhuangtongfa.material-theme