tap "denisidoro/tools"
tap "espanso/espanso"
tap "homebrew/services"
tap "nikolaeu/numi"
brew "adr-tools"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.13"
brew "awscli"
brew "bash"
brew "bat"
brew "commitizen"
brew "coreutils"
brew "findutils"
brew "fswatch"
brew "fzf"
brew "lz4"
brew "gcc"
brew "git-delta"
brew "gnu-sed"
brew "hyperfine"
brew "jq"
brew "libb2"
brew "libtiff"
brew "make"
brew "mas"
brew "openjdk"
brew "maven"
brew "neovim"
brew "openfortivpn"
brew "pyenv"
brew "python@3.12"
brew "sevenzip"
brew "tcl-tk@8"
brew "tree"
brew "wget"
brew "zlib"
brew "zsh"
brew "denisidoro/tools/docpars"
cask "espanso"
cask "firefox"
cask "gimp"
cask "karabiner-elements"
cask "warp"
mas "HP Smart", id: 1474276998
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Monosnap", id: 540348655
mas "OneDrive", id: 823766827
mas "WhatsApp", id: 310633997
vscode "2gua.rainbow-brackets"
vscode "astro-build.astro-vscode"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "in4margaret.compareit"
vscode "jorgeserrano.vscode-csharp-snippets"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mathiasfrohlich.kotlin"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naco-siren.gradle-language"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "sirtori.indenticator"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
